In [24]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, np.nan, 40, 28],  # 年齢に欠損値を含む
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami'],
    'Salary': [60000, 75000, 80000, np.nan, 65000]  # 給与に欠損値を含む
}

df = pd.DataFrame(data)

# データフレームの内容を表示
df

      Name   Age         City   Salary
0    Alice  25.0     New York  60000.0
1      Bob  30.0  Los Angeles  75000.0
2  Charlie   NaN      Chicago  80000.0
3    David  40.0      Houston      NaN
4      Eva  28.0        Miami  65000.0

In [27]:
df[df["Name"]== "Charlie"]["Age"].tolist()[0]

nan

In [56]:
result = []

hoge = []
hoge.append("N001")
hoge.append(df[df["Name"]== "Bob"]["Age"].tolist()[0])
hoge.append(df[df["Name"]== "Charlie"]["Age"].tolist()[0])
hoge.append(df[df["Name"]== "Charlie"]["Age"].tolist()[0])
result.append(hoge)
hoge

['N001', 30.0, nan, nan]

In [57]:
hoge = []
hoge.append("N002")
hoge.append(df[df["City"]== "Houston"]["Salary"].tolist()[0])
hoge.append(df[df["City"]== "New York"]["Salary"].tolist()[0])
hoge.append(df[df["City"]== "Houston"]["Salary"].tolist()[0])
result.append(hoge)

hoge = []
hoge.append("N003")
hoge.append(df[df["City"]== "Los Angeles"]["Salary"].tolist()[0])
hoge.append(df[df["City"]== "Miami"]["Salary"].tolist()[0])
hoge.append(df[df["City"]== "Miami"]["Salary"].tolist()[0])
result.append(hoge)

result

[['N001', 30.0, nan, nan],
 ['N002', nan, 60000.0, nan],
 ['N003', 75000.0, 65000.0, 65000.0]]

In [87]:
result = pd.DataFrame(result)
result

      0        1        2        3
0  N001     30.0      NaN      NaN
1  N002      NaN  60000.0      NaN
2  N003  75000.0  65000.0  65000.0

In [83]:
a = result[[2,3]].sum(axis="columns")
b = result[[1]].sum(axis="columns")
a

0         0.0
1     60000.0
2    130000.0
dtype: float64

In [82]:
fuga = []
for i in range(len(a)):
    if((a[i] != 0) & (b[i] != 0)):
        fuga.append("KandZ")
    elif (a[i] != 0):
        fuga.append("K")
    elif (b[i] != 0):
        fuga.append("Z")
fuga

['Z', 'K', 'KandZ']

In [88]:
fuga = pd.DataFrame(fuga)
pd.concat([result,fuga],axis="columns")

      0        1        2        3      0
0  N001     30.0      NaN      NaN      Z
1  N002      NaN  60000.0      NaN      K
2  N003  75000.0  65000.0  65000.0  KandZ